In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
data = pd.read_csv('data/boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [4]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [5]:
pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [6]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [7]:
tasks+=1
pd.read_sql(
    '''
    SELECT 'CRIM' AS ColumnName, COUNT(*) AS CountEmpty
    FROM boston
    WHERE CRIM IS NULL
    UNION
    SELECT 'ZN', COUNT(*)
    FROM boston
    WHERE ZN IS NULL
    UNION
    SELECT 'INDUS', COUNT(*)
    FROM boston
    WHERE INDUS IS NULL
    UNION
    SELECT 'CHAS', COUNT(*)
    FROM boston
    WHERE CHAS IS NULL
    UNION
    SELECT 'NOX', COUNT(*)
    FROM boston
    WHERE NOX IS NULL;
    ''',
    con,
)

  ColumnName  CountEmpty
0       CHAS           0
1       CRIM           0
2      INDUS           0
3        NOX           0
4         ZN           0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [8]:
tasks+=1
pd.read_sql(
    '''
    SELECT 'CRIM' AS ColumnName, COUNT(DISTINCT CRIM) AS CountUnique
    FROM boston
    UNION
    SELECT 'ZN', COUNT(DISTINCT ZN)
    FROM boston
    UNION
    SELECT 'INDUS', COUNT(DISTINCT INDUS)
    FROM boston
    UNION
    SELECT 'CHAS', COUNT(DISTINCT CHAS)
    FROM boston
    UNION
    SELECT 'NOX', COUNT(DISTINCT NOX)
    FROM boston;
    ''',
    con,
)

  ColumnName  CountUnique
0       CHAS            2
1       CRIM          504
2      INDUS           76
3        NOX           81
4         ZN           26

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [9]:
tasks+=1
pd.read_sql(
    '''
    WITH t AS (
        SELECT 'CRIM' as ColumnName, AVG(CRIM) AS Median
            FROM (SELECT CRIM
                FROM boston
                ORDER BY CRIM
                LIMIT (SELECT iif(COUNT(*) % 2 = 0, 2, 1) FROM boston)
                    OFFSET (SELECT iif(COUNT(*) % 2 = 0, COUNT(*) / 2 - 1, COUNT(*) / 2) FROM boston)
            )
        UNION
        SELECT 'ZN', AVG(ZN)
            FROM (SELECT ZN
                FROM boston
                ORDER BY ZN
                LIMIT (SELECT iif(COUNT(*) % 2 = 0, 2, 1) FROM boston)
                    OFFSET (SELECT iif(COUNT(*) % 2 = 0, COUNT(*) / 2 - 1, COUNT(*) / 2) FROM boston)
            )
        UNION
        SELECT 'INDUS', AVG(INDUS)
            FROM (SELECT INDUS
                FROM boston
                ORDER BY INDUS
                LIMIT (SELECT iif(COUNT(*) % 2 = 0, 2, 1) FROM boston)
                    OFFSET (SELECT iif(COUNT(*) % 2 = 0, COUNT(*) / 2 - 1, COUNT(*) / 2) FROM boston)
            )
        UNION
        SELECT 'CHAS', AVG(CHAS)
            FROM (SELECT CHAS
                FROM boston
                ORDER BY CHAS
                LIMIT (SELECT iif(COUNT(*) % 2 = 0, 2, 1) FROM boston)
                    OFFSET (SELECT iif(COUNT(*) % 2 = 0, COUNT(*) / 2 - 1, COUNT(*) / 2) FROM boston)
            )
        UNION
        SELECT 'NOX', AVG(NOX)
            FROM (SELECT NOX
                FROM boston
                ORDER BY NOX
                LIMIT (SELECT iif(COUNT(*) % 2 = 0, 2, 1) FROM boston)
                    OFFSET (SELECT iif(COUNT(*) % 2 = 0, COUNT(*) / 2 - 1, COUNT(*) / 2) FROM boston)
            )
    )
    
    SELECT *
    FROM t
    WHERE Median = (SELECT MIN(Median) FROM t);
    ''',
    con,
)

  ColumnName  Median
0       CHAS     0.0
1         ZN     0.0

**–í—ã–≤–æ–¥:**

–í —Å—Ç–æ–ª–±—Ü–∞—Ö CHAS –∏ ZN –±–æ–ª—å—à–µ –ø–æ–ª–æ–≤–∏–Ω—ã –Ω—É–ª–µ–≤—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π.

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [10]:
tasks+=1
pd.read_sql(
    '''
    SELECT
        u.NumHouses,
        ROUND(u.AVG_RM_EXPENSIVE, 3) AS AVG_RM_EXPENSIVE,
        ROUND(u.AVG_RM_CHEAP, 3) AS AVG_RM_CHEAP,
        ROUND(u.AVG_RM_EXPENSIVE - u.AVG_RM_CHEAP, 3) AS AVG_RM_DIFF
    FROM (
        SELECT
            25 AS NumHouses,
            AVG_RM_EXPENSIVE.RM AS AVG_RM_EXPENSIVE,
            AVG_RM_CHEAP.RM AS AVG_RM_CHEAP
        FROM
            (SELECT AVG(RM) AS RM FROM boston
                WHERE MEDV IN (
                    SELECT MEDV FROM boston
                    ORDER BY MEDV DESC
                    LIMIT 1)) AS AVG_RM_EXPENSIVE,
            (SELECT AVG(t.RM) AS RM FROM (
                SELECT RM FROM boston AS b
                ORDER BY MEDV ASC
                LIMIT 25) AS t) AS AVG_RM_CHEAP
        UNION
        SELECT
            50 AS Num, AVG_RM_EXPENSIVE.RM, AVG_RM_CHEAP.RM
        FROM
            (SELECT AVG(RM) AS RM FROM boston
                WHERE MEDV IN (
                    SELECT MEDV FROM boston
                    ORDER BY MEDV DESC
                    LIMIT 1)) AS AVG_RM_EXPENSIVE,
            (SELECT AVG(t.RM) AS RM FROM (
                SELECT RM FROM boston AS b
                ORDER BY MEDV ASC
                LIMIT 50) AS t) AS AVG_RM_CHEAP
        UNION
        SELECT
            100 AS Num, AVG_RM_EXPENSIVE.RM, AVG_RM_CHEAP.RM
        FROM
            (SELECT AVG(RM) AS RM FROM boston
                WHERE MEDV IN (
                    SELECT MEDV FROM boston
                    ORDER BY MEDV DESC
                    LIMIT 1)) AS AVG_RM_EXPENSIVE,
            (SELECT AVG(t.RM) AS RM FROM (
                SELECT RM FROM boston AS b
                ORDER BY MEDV ASC
                LIMIT 100) AS t) AS AVG_RM_CHEAP
        UNION
        SELECT
            200 AS Num, AVG_RM_EXPENSIVE.RM, AVG_RM_CHEAP.RM
        FROM
            (SELECT AVG(RM) AS RM FROM boston
                WHERE MEDV IN (
                    SELECT MEDV FROM boston
                    ORDER BY MEDV DESC
                    LIMIT 1)) AS AVG_RM_EXPENSIVE,
            (SELECT AVG(t.RM) AS RM FROM (
                SELECT RM FROM boston AS b
                ORDER BY MEDV ASC
                LIMIT 200) AS t) AS AVG_RM_CHEAP
        UNION
        SELECT
            300 AS Num, AVG_RM_EXPENSIVE.RM, AVG_RM_CHEAP.RM
        FROM
            (SELECT AVG(RM) AS RM FROM boston
                WHERE MEDV IN (
                    SELECT MEDV FROM boston
                    ORDER BY MEDV DESC
                    LIMIT 1)) AS AVG_RM_EXPENSIVE,
            (SELECT AVG(t.RM) AS RM FROM (
                SELECT RM FROM boston AS b
                ORDER BY MEDV ASC
                LIMIT 300) AS t) AS AVG_RM_CHEAP
    ) AS u;
    ''',
    con,
)

   NumHouses  AVG_RM_EXPENSIVE  AVG_RM_CHEAP  AVG_RM_DIFF
0         25             7.484         5.748        1.736
1         50             7.484         5.753        1.731
2        100             7.484         5.887        1.597
3        200             7.484         5.912        1.572
4        300             7.484         5.972        1.512

**–í—ã–≤–æ–¥:**

–ß–µ–º –±–æ–ª—å—à–µ –∫–æ–º–Ω–∞—Ç –≤ –¥–æ–º–µ, —Ç–µ–º –º–µ–Ω—å—à–µ —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É –¥–æ—Ä–æ–≥–∏–º–∏ –∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏.

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [11]:
tasks+=1
pd.read_sql(
    '''
    SELECT t.LSTAT, t.RNK_LSTAT
    FROM (
        SELECT
            MEDV,
            LSTAT,
            RANK() OVER (ORDER BY LSTAT) AS RNK_LSTAT
        FROM boston
    ) AS t
    WHERE t.MEDV IN (SELECT MAX(MEDV) FROM boston);
    ''',
    con,
)

    LSTAT  RNK_LSTAT
0    1.73          1
1    1.92          2
2    2.88          6
3    2.96          8
4    2.97          9
5    3.16         15
6    3.26         17
7    3.32         18
8    3.70         26
9    3.73         27
10   4.45         41
11   4.63         50
12   5.12         67
13   7.44        141
14   8.88        181
15   9.53        203

**–í—ã–≤–æ–¥:**

–í –±–æ–ª–µ–µ –¥–æ—Ä–æ–≥–∏—Ö –¥–æ–º–∞—Ö –ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º –Ω–∏–∂–µ.

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [12]:
tasks+=1
pd.read_sql(
    '''
    SELECT
        CASE
            WHEN CHAS > 0 THEN '–≥—Ä–∞–Ω–∏—á–∏—Ç'
            ELSE '–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç'
        END AS RIVER,
        ROUND(AVG(MEDV), 2) AS AVG_MEDV
    FROM boston AS b
    GROUP BY CHAS
    ORDER BY CHAS DESC;
    ''',
    con,
)

         RIVER  AVG_MEDV
0     –≥—Ä–∞–Ω–∏—á–∏—Ç     28.44
1  –Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç     22.09

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [13]:
tasks+=1
pd.read_sql(
    '''
    SELECT t.ColumnName
    FROM (
        SELECT 'CRIM' AS ColumnName, COUNT(*) AS CNT
        FROM boston AS b
        WHERE (SELECT AVG(CRIM) FROM boston WHERE CHAS = 1) > (SELECT AVG(CRIM) FROM boston)
        UNION
        SELECT 'ZN', COUNT(*) AS CNT
        FROM boston AS b
        WHERE (SELECT AVG(ZN) FROM boston WHERE CHAS = 1) > (SELECT AVG(ZN) FROM boston)
        UNION
        SELECT 'INDUS', COUNT(*) AS CNT
        FROM boston AS b
        WHERE (SELECT AVG(INDUS) FROM boston WHERE CHAS = 1) > (SELECT AVG(INDUS) FROM boston)
        UNION
        SELECT 'NOX', COUNT(*) AS CNT
        FROM boston AS b
        WHERE (SELECT AVG(NOX) FROM boston WHERE CHAS = 1) > (SELECT AVG(NOX) FROM boston)
    ) AS t
    WHERE t.CNT > 0;
    ''',
    con,
)

  ColumnName
0      INDUS
1        NOX

**–í—ã–≤–æ–¥:**

–û–∫–æ–ª–æ –≤–æ–¥—ã –≤—ã—à–µ –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞, –∞ —Ç–∞–∫–∂–µ –≤—ã—à–µ –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞.

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [14]:
tasks+=1
pd.read_sql(
    '''
    SELECT
        ROUND(AVG(t.INDUS), 2) AS INDUS,
        ROUND(AVG(t.NOX), 2) AS NOX,
        t.PCT AS PERCENTILE
    FROM (
        SELECT
            INDUS, NOX, (NTILE(10) OVER (ORDER BY INDUS, NOX)) * 10 AS PCT
        FROM boston
    ) AS t
    GROUP BY t.PCT
    ORDER BY t.PCT;
    ''',
    con,
)

   INDUS   NOX  PERCENTILE
0   2.02  0.44          10
1   3.65  0.49          20
2   5.25  0.45          30
3   6.47  0.47          40
4   8.26  0.53          50
5  10.75  0.52          60
6  17.25  0.56          70
7  18.10  0.68          80
8  18.31  0.71          90
9  21.94  0.69         100

**–í—ã–≤–æ–¥:**

–° —É–≤–µ–ª–∏—á–µ–Ω–∏–µ–º –¥–æ–ª–∏ –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏ —Ä–∞—Å—Ç–µ—Ç –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞.

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [15]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ